standardCybertruck/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  format ascii;
  class dictionary;
  location "constant";
  object momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS {
  // Tested with kEpsilon, realizableKE, kOmega, kOmega2006, kOmegaSST, v2f,
  // ShihQuadraticKE, LienCubicKE.
  model kOmegaSST;

  turbulence on;

  printCoeffs on;

  viscosityModel Newtonian;
}

// ************************************************************************* //
