standardCybertruck/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

UInlet            (-30 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $UInlet;
    }

    outlet
    {
        type            zeroGradient;
        //type            inletOutlet;
        //value            uniform $UInlet;
        //inletValue        uniform $UInlet;
    }

    bodyCassoneChiuso_mm
    {
        type            noSlip;
    }

    FR_mm
    {
        type            movingWallVelocity;
        origin          (1.948045 -1.00115  -0.428600);
        axis            (0 1 0);
        omega           67.887126;
        value           uniform (0 0 0);
    }

    RR_mm
    {
        type            movingWallVelocity;
        origin          (-1.726285 -1.00115  -0.428600);
        axis            (0 1 0);
        omega           67.887126;
        value           uniform (0 0 0);
    }

    tarmac
    {
        type            fixedValue;
        value           uniform $UInlet;
    }

    "(upperArea|lateralArea)"
    {
        type            fixedValue;
        value           uniform $UInlet;
        //type            slip;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}

// ************************************************************************* //
