standardCybertruck/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        //type            fixedValue;
        value           uniform 0;
    }

    "(upperArea|lateralArea)"
    {
        type                     zeroGradient;
        //type                       slip;
    }

    "(tarmac|bodyCassoneChiuso_mm|FR_mm|RR_mm)"
    {
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}

// ************************************************************************* //
